n1 = str(input("Введите название товара 1: "))
p1 = float(input("Введите цену товара 1: "))
k1 = int(input("Введите количество товара 1: "))
i1 = str(input("Введите единицу измерения товара 1: "))
n2 = input("Введите название товара 2: ")
p2 = input("Введите цену товара 2: ")
k2 = input("Введите количество товара 2: ")
i2 = input("Введите единицу измерения товара 2: ")
n3 = input("Введите название товара 3: ")
p3 = input("Введите цену товара 3: ")
k3 = input("Введите количество товара 3: ")
i3 = input("Введите единицу измерения товара 3: ")
my_dict1 = {"название": n1, "цена": p1, "количество": k1, "ед": i1}
my_dict2 = {"название": n2, "цена": p2, "количество": k2, "ед": i2}
my_dict3 = {"название": n3, "цена": p3, "количество": k3, "ед": i3}
t1 = (1, my_dict1)
t2 = (2, my_dict2)
t3 = (3, my_dict3)
structure = [t1, t2, t3]
print("Структура данных Товары: ", structure)
analytics = {"название": [n1, n2, n3], "цена": [p1, p2, p3], "количество": [k1, k2, k3], "ед": [i1, i2, i3]}
print("Аналитика товаров: ", analytics)